app/controllers/favorites_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "3"]]
INSERT INTO "favorites" ("created_at", "favoritee_id", "favoriter_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 26 Jul 2012 11:44:55 UTC +00:00], ["favoritee_id", 2], ["favoriter_id", 4], ["updated_at", Thu, 26 Jul 2012 11:44:55 UTC +00:00]]
---
  def create
  	@profile= Profile.find(params[:profile_id])
  	@favorite= current_user.profile.favorites.build(favoritee_id: @profile.id)
  	respond_to do |f|
  		if @favorite.save

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "2"]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
  def destroy
  	@profile= Profile.find(params[:profile_id])
  	@favorite= Favorite.find(params[:id])
  	#@favorite= current_user.profile.favorites.find_by_favoritee_id(params[:profile_id])
  	respond_to do |f|
  		if @favorite.destroy