app/controllers/pages_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 3 ORDER BY created_at DESC LIMIT 1
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "profiles" LIMIT 30) subquery_for_count
---
  def home
  	if signed_in? && current_user.profile
  		@feed_items= current_user.news_feed
	  	@viewed_count= current_user.profile.viewed_by.count
      @favorited_by_count= current_user.profile.favorited_by.count
      @search = Search.where("profile_id= ? AND save_search= ?", current_user.profile, true)
      @search.any? ? @search= @search.last : @search= Search.new