app/controllers/photos_controller.rb

  def create
  	@photo= @profile.photos.build(params[:photo])
  	if (@profile == current_user.profile) && @photo.save
---
INSERT INTO "photos" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "caption", "created_at", "primary", "profile_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)