app/controllers/private_messages_controller.rb

SELECT "private_messages".* FROM "private_messages" WHERE "private_messages"."id" = ? ORDER BY private_messages.created_at DESC LIMIT 1  [["id", "1"]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 3 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
  def show
  	@current_message= PrivateMessage.find(params[:id])
  	unless (current_user.id==@current_message.receiver_id) || (current_user.id== @current_message.sender_id)
  		redirect_to root_path, flash: { error: "You don't have permission to access this page."}
  	end
    if @current_message.conversation   #this bit of ensures the conversation head gets passed in
      @current_message= @current_message.conversation
    end
  	@sender= User.find(@current_message.sender_id).profile

SELECT "private_messages".* FROM "private_messages" WHERE (receiver_id=1) ORDER BY private_messages.created_at DESC
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 3 ORDER BY created_at DESC LIMIT 1
---
  def index
    @messages= PrivateMessage.where("sender_id= ? OR receiver_id= ?", current_user.profile.id,
        current_user.profile.id)

INSERT INTO "private_messages" ("body", "conversation_id", "created_at", "read_at", "receiver_id", "sender_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    convo= PrivateMessage.current_conversation(current_user.id, params[:private_message][:receiver_id])
    if convo.nil?
      message= current_user.sent_messages.build(params[:private_message])
      if message.save