app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("about_me", "age", "avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "body_type", "created_at", "drinks", "drugs", "ethnicity", "exercise", "formatted_height", "good_at", "height", "hidden", "income", "interested_in", "job", "language", "location", "message_me_if", "new_user", "nick_name", "offspring", "photos_count", "relationship_status", "religion", "sex", "smokes", "updated_at", "user_id", "zip_code", "zipcode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @profile= current_user.build_profile(params[:profile])
    @profile.nick_name= current_user.nick_name
    if @profile.save

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "1"]]
UPDATE "profiles" SET "about_me" = '
---
  def update
    @profile= Profile.find(params[:id])
    if @profile.update_attributes(params[:profile])

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "2"]]
---
  def show
    @profile= Profile.find(params[:id])

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "1"]]
---
  def edit
    @profile= Profile.find(params[:id])

SELECT "profiles".* FROM "profiles" WHERE "profiles"."hidden" = 'f' ORDER BY created_at DESC
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 3 ORDER BY created_at DESC LIMIT 1
---
  def index
    @profiles= Profile.paginate(page: params[:page], per_page: 30).where(hidden: false)
    @search= current_user.profile.searches.first || Search.new