app/controllers/profiles_controller.rb

  def destroy
    @profile= Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "3"]]