app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "name", "nick_name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
UPDATE "users" SET "name" = 'New Name', "email" = 'newemail@example.com', "password_digest" = '$2a$10$B603p34RuSpsU8s2CFSmk.2GWssvR4.0OxC7/MagyQ6XGw.BqDzBy', "updated_at" = '2012-08-16 20:33:27.380730' WHERE "users"."id" = 1