app/controllers/winks_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "winks" ("created_at", "receiver_id", "sender_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 25 Jul 2012 21:23:21 UTC +00:00], ["receiver_id", 2], ["sender_id", 3], ["updated_at", Wed, 25 Jul 2012 21:23:21 UTC +00:00]]
---
  def create
  	@profile= Profile.find(params[:profile_id])
    @wink= current_user.profile.sent_winks.build(receiver_id: params[:profile_id])
  	respond_to do |f|
      if @wink.save